src/app/controllers/listings_controller.rb

    def index
        # show all listings
        @listings = Listing.all.sorted_id
---
SELECT "listings".* FROM "listings" ORDER BY "listings"."id" DESC

    def create
        # create new listing with values added in the form (listing_params)
        @listing = Listing.create(listing_params)
---
INSERT INTO "listings" ("title", "description", "city", "state", "diet", "breed_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["title", ""], ["description", ""], ["city", ""], ["state", ""], ["diet", ""], ["breed_id", 1], ["created_at", "2020-05-02 10:05:04.162167"], ["updated_at", "2020-05-02 10:05:04.162167"]]

    def update
        # show listing with id selected
        # set_listing
        # save updated listing to @updated_listing
        @updated_listing = @listing.update(listing_params)
---
UPDATE "listings" SET "age" = $1, "updated_at" = $2 WHERE "listings"."id" = $3  [["age", 4], ["updated_at", "2020-05-02 06:19:33.843305"], ["id", 4]]

    def destroy
        # delete the listing from database
        Listing.find(params[:id]).destroy
---
DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 20]]
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]

        def set_breed_sex
            @breeds = Breed.all
---
SELECT "breeds".* FROM "breeds"